----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1       [-1, 64, 64, 64, 64]           6,912
       BatchNorm3d-2       [-1, 64, 64, 64, 64]             128
              ReLU-3       [-1, 64, 64, 64, 64]               0
            Conv3d-4       [-1, 64, 64, 64, 64]         110,592
       BatchNorm3d-5       [-1, 64, 64, 64, 64]             128
              ReLU-6       [-1, 64, 64, 64, 64]               0
         MaxPool3d-7       [-1, 64, 32, 32, 32]               0
            Conv3d-8      [-1, 128, 32, 32, 32]         221,184
       BatchNorm3d-9      [-1, 128, 32, 32, 32]             256
             ReLU-10      [-1, 128, 32, 32, 32]               0
           Conv3d-11      [-1, 128, 32, 32, 32]         442,368
      BatchNorm3d-12      [-1, 128, 32, 32, 32]             256
             ReLU-13      [-1, 128, 32, 32, 32]               0
        MaxPool3d-14      [-1, 128, 16, 16, 16]               0
           Conv3d-15      [-1, 256, 16, 16, 16]         884,736
      BatchNorm3d-16      [-1, 256, 16, 16, 16]             512
             ReLU-17      [-1, 256, 16, 16, 16]               0
           Conv3d-18      [-1, 256, 16, 16, 16]       1,769,472
      BatchNorm3d-19      [-1, 256, 16, 16, 16]             512
             ReLU-20      [-1, 256, 16, 16, 16]               0
        MaxPool3d-21         [-1, 256, 8, 8, 8]               0
           Conv3d-22         [-1, 512, 8, 8, 8]       3,538,944
      BatchNorm3d-23         [-1, 512, 8, 8, 8]           1,024
             ReLU-24         [-1, 512, 8, 8, 8]               0
           Conv3d-25         [-1, 512, 8, 8, 8]       7,077,888
      BatchNorm3d-26         [-1, 512, 8, 8, 8]           1,024
             ReLU-27         [-1, 512, 8, 8, 8]               0
        MaxPool3d-28         [-1, 512, 4, 4, 4]               0
           Conv3d-29        [-1, 1024, 4, 4, 4]      14,155,776
      BatchNorm3d-30        [-1, 1024, 4, 4, 4]           2,048
             ReLU-31        [-1, 1024, 4, 4, 4]               0
           Conv3d-32        [-1, 1024, 4, 4, 4]      28,311,552
      BatchNorm3d-33        [-1, 1024, 4, 4, 4]           2,048
             ReLU-34        [-1, 1024, 4, 4, 4]               0
  ConvTranspose3d-35         [-1, 512, 8, 8, 8]       4,194,816
           Conv3d-36         [-1, 512, 8, 8, 8]      14,155,776
      BatchNorm3d-37         [-1, 512, 8, 8, 8]           1,024
             ReLU-38         [-1, 512, 8, 8, 8]               0
           Conv3d-39         [-1, 512, 8, 8, 8]       7,077,888
      BatchNorm3d-40         [-1, 512, 8, 8, 8]           1,024
             ReLU-41         [-1, 512, 8, 8, 8]               0
  ConvTranspose3d-42      [-1, 256, 16, 16, 16]       1,048,832
           Conv3d-43      [-1, 256, 16, 16, 16]       3,538,944
      BatchNorm3d-44      [-1, 256, 16, 16, 16]             512
             ReLU-45      [-1, 256, 16, 16, 16]               0
           Conv3d-46      [-1, 256, 16, 16, 16]       1,769,472
      BatchNorm3d-47      [-1, 256, 16, 16, 16]             512
             ReLU-48      [-1, 256, 16, 16, 16]               0
  ConvTranspose3d-49      [-1, 128, 32, 32, 32]         262,272
           Conv3d-50      [-1, 128, 32, 32, 32]         884,736
      BatchNorm3d-51      [-1, 128, 32, 32, 32]             256
             ReLU-52      [-1, 128, 32, 32, 32]               0
           Conv3d-53      [-1, 128, 32, 32, 32]         442,368
      BatchNorm3d-54      [-1, 128, 32, 32, 32]             256
             ReLU-55      [-1, 128, 32, 32, 32]               0
  ConvTranspose3d-56       [-1, 64, 64, 64, 64]          65,600
           Conv3d-57       [-1, 64, 64, 64, 64]         221,184
      BatchNorm3d-58       [-1, 64, 64, 64, 64]             128
             ReLU-59       [-1, 64, 64, 64, 64]               0
           Conv3d-60       [-1, 64, 64, 64, 64]         110,592
      BatchNorm3d-61       [-1, 64, 64, 64, 64]             128
             ReLU-62       [-1, 64, 64, 64, 64]               0
           Conv3d-63        [-1, 4, 64, 64, 64]             260
          Sigmoid-64        [-1, 4, 64, 64, 64]               0
================================================================
Total params: 90,303,940
Trainable params: 90,303,940
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 4.00
Forward/backward pass size (MB): 2250.25
Params size (MB): 344.48
Estimated Total Size (MB): 2598.73
----------------------------------------------------------------


Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to
==================================================================================================
 input_1 (InputLayer)           [(None, 128, 128, 1  0           []
                                28, 3)]

 conv3d (Conv3D)                (None, 128, 128, 12  1312        ['input_1[0][0]']
                                8, 16)

 dropout (Dropout)              (None, 128, 128, 12  0           ['conv3d[0][0]']
                                8, 16)

 conv3d_1 (Conv3D)              (None, 128, 128, 12  6928        ['dropout[0][0]']
                                8, 16)

 max_pooling3d (MaxPooling3D)   (None, 64, 64, 64,   0           ['conv3d_1[0][0]']
                                16)

 conv3d_2 (Conv3D)              (None, 64, 64, 64,   13856       ['max_pooling3d[0][0]']
                                32)

 dropout_1 (Dropout)            (None, 64, 64, 64,   0           ['conv3d_2[0][0]']
                                32)

 conv3d_3 (Conv3D)              (None, 64, 64, 64,   27680       ['dropout_1[0][0]']
                                32)

 max_pooling3d_1 (MaxPooling3D)  (None, 32, 32, 32,   0          ['conv3d_3[0][0]']
                                32)

 conv3d_4 (Conv3D)              (None, 32, 32, 32,   55360       ['max_pooling3d_1[0][0]']
                                64)

 dropout_2 (Dropout)            (None, 32, 32, 32,   0           ['conv3d_4[0][0]']
                                64)

 conv3d_5 (Conv3D)              (None, 32, 32, 32,   110656      ['dropout_2[0][0]']
                                64)

 max_pooling3d_2 (MaxPooling3D)  (None, 16, 16, 16,   0          ['conv3d_5[0][0]']
                                64)

 conv3d_6 (Conv3D)              (None, 16, 16, 16,   221312      ['max_pooling3d_2[0][0]']
                                128)

 dropout_3 (Dropout)            (None, 16, 16, 16,   0           ['conv3d_6[0][0]']
                                128)

 conv3d_7 (Conv3D)              (None, 16, 16, 16,   442496      ['dropout_3[0][0]']
                                128)

 max_pooling3d_3 (MaxPooling3D)  (None, 8, 8, 8, 128  0          ['conv3d_7[0][0]']
                                )

 conv3d_8 (Conv3D)              (None, 8, 8, 8, 256  884992      ['max_pooling3d_3[0][0]']
                                )

 dropout_4 (Dropout)            (None, 8, 8, 8, 256  0           ['conv3d_8[0][0]']
                                )

 conv3d_9 (Conv3D)              (None, 8, 8, 8, 256  1769728     ['dropout_4[0][0]']
                                )

 conv3d_transpose (Conv3DTransp  (None, 16, 16, 16,   262272     ['conv3d_9[0][0]']
 ose)                           128)

 concatenate (Concatenate)      (None, 16, 16, 16,   0           ['conv3d_transpose[0][0]',
                                256)                              'conv3d_7[0][0]']

 conv3d_10 (Conv3D)             (None, 16, 16, 16,   884864      ['concatenate[0][0]']
                                128)

 dropout_5 (Dropout)            (None, 16, 16, 16,   0           ['conv3d_10[0][0]']
                                128)

 conv3d_11 (Conv3D)             (None, 16, 16, 16,   442496      ['dropout_5[0][0]']
                                128)

 conv3d_transpose_1 (Conv3DTran  (None, 32, 32, 32,   65600      ['conv3d_11[0][0]']
 spose)                         64)

 concatenate_1 (Concatenate)    (None, 32, 32, 32,   0           ['conv3d_transpose_1[0][0]',
                                128)                              'conv3d_5[0][0]']

 conv3d_12 (Conv3D)             (None, 32, 32, 32,   221248      ['concatenate_1[0][0]']
                                64)

 dropout_6 (Dropout)            (None, 32, 32, 32,   0           ['conv3d_12[0][0]']
                                64)

 conv3d_13 (Conv3D)             (None, 32, 32, 32,   110656      ['dropout_6[0][0]']
                                64)

 conv3d_transpose_2 (Conv3DTran  (None, 64, 64, 64,   16416      ['conv3d_13[0][0]']
 spose)                         32)

 concatenate_2 (Concatenate)    (None, 64, 64, 64,   0           ['conv3d_transpose_2[0][0]',
                                64)                               'conv3d_3[0][0]']

 conv3d_14 (Conv3D)             (None, 64, 64, 64,   55328       ['concatenate_2[0][0]']
                                32)

 dropout_7 (Dropout)            (None, 64, 64, 64,   0           ['conv3d_14[0][0]']
                                32)

 conv3d_15 (Conv3D)             (None, 64, 64, 64,   27680       ['dropout_7[0][0]']
                                32)

 conv3d_transpose_3 (Conv3DTran  (None, 128, 128, 12  4112       ['conv3d_15[0][0]']
 spose)                         8, 16)

 concatenate_3 (Concatenate)    (None, 128, 128, 12  0           ['conv3d_transpose_3[0][0]',
                                8, 32)                            'conv3d_1[0][0]']

 conv3d_16 (Conv3D)             (None, 128, 128, 12  13840       ['concatenate_3[0][0]']
                                8, 16)

 dropout_8 (Dropout)            (None, 128, 128, 12  0           ['conv3d_16[0][0]']
                                8, 16)

 conv3d_17 (Conv3D)             (None, 128, 128, 12  6928        ['dropout_8[0][0]']
                                8, 16)

 conv3d_18 (Conv3D)             (None, 128, 128, 12  68          ['conv3d_17[0][0]']
                                8, 4)

==================================================================================================
Total params: 5,645,828
Trainable params: 5,645,828
Non-trainable params: 0